# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть, 
# чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть
"""
n = int(input('Введите количество монет: '))
eagle = 0
tails = 0
for i in range(n):
    x = int(input('Для выбора орла нажмите: 1. Для выбора решки нажмите: 0: '))
    if x == 1:
        eagle += 1
    else:
        tails += 1
if eagle < tails:
    print(f'Монет нужно перевернуть с орла на решку: {eagle}')
elif eagle == tails:
    print(f'У вас одинаковое количество монет "{eagle}" имеют орла и решку')
else:
    print(f'Монет нужно перевернуть с решки на орла: {eagle}') 
"""

# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), 
# а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

"""
s = int(input('Укажите сумму двух натуральных чисел: '))
p = int(input('Укажите произведение двух натуральных чисел: '))
c = 0
for x in range (0, 1000):
    if c: break
    for y in range (0, 1000):
        if s == x + y and p == x * y:
            c = 1
            print(f'Первое число: "{x}", второе число: "{y}"')
            break
else:
    print('Петя загадал другие числа.') 

"""
# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
n = int(input('Введите число: '))
x = 0
p = 2
for i in range(n):
    if x != 1:
        p = p ** i
        if p <= n:
            print(p, end = ' ')
            p = 2
        else:
            x = 1
    else:
        i = n 