# Задача 1: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. 
# n — кол-во элементов первого множества. 
# m — кол-во элементов второго множества. 
# Затем пользователь вводит сами элементы множеств.
"""
res = []

n = int(input("Введите кол-во элементов первого множества: "))
m = int(input("Введите кол-во элементов второго множества: "))

nlist = []
mlist = [] 

for i in range(n):
    nlist.append(int(input(f'{i+1} элемент первого множества числе: ')))
for k in range(m):
    mlist.append(int(input(f'{k+1} элемент второго множества числе: ')))

for t in nlist:
    for y in mlist:
        if t == y:
            res.append(t)

res.sort()
print(res)
"""

# Задача 2: В фермерском хозяйстве в Карелии выращивают чернику.
# Она растёт на круглой грядке, причём кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних.
# Всего на грядке растёт N кустов. Эти кусты обладают разной урожайностью,
# поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод,
# которое может собрать за один заход собирающий модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.

n = int(input("Введите кол-во кустов: "))
while n < 3:
    dictionary = input("Ошибка! Кол-во кустов не должно быть меньше 3. \nВведите кол-во кустов:: ")
    break

numbers = list()
for i in range(n):
    numbers.append(int(input(f"Введите кол-во ягод на кусте {i + 1}: ")))

numbers_count = list()
for i in range(len(numbers) - 1):
    numbers_count.append(numbers[i - 1] + numbers[i] + numbers[i + 1])
numbers_count.append(numbers[-2] + numbers[-1] + numbers[0])


print(f"Максимального числа ягод: {max(numbers_count)}")